Repository: 5818959/drupal_tfa
Catalog: translations/tfa-7.x-2.0.*.po
Languages: ru

source: The TFA module requires the PHP Mcrypt extension be installed on the web server. See <a href="!link">the TFA help documentation</a> for setup.
ru: Модуль TFA требует, чтобы расширение PHP Mcrypt было установлено на веб-сервере. См. <a href="!link"> справочную документацию TFA</a> для настройки.

source: No plugins available for validation. See <a href="!link">the TFA help documentation</a> for setup.
ru: Нет доступных плагинов для проверки. См. <a href="!link"> справочную документацию TFA </a> для настройки.

source: Available plugins
ru: Доступные плагины

source: Enable TFA
ru: Включить TFA

source: Enable TFA for account authentication.
ru: Включить TFA для аутентификации учетной записи.

source: Default validation plugin
ru: Плагин по умолчанию

source: Plugin that will be used as the default TFA process.
ru: Плагин, который будет использоваться для TFA по умолчанию.

source: No available validation plugins available. TFA process will not occur.
ru: Нет доступных плагинов проверки. Процесс TFA не будет происходить.

source: Validation fallback plugins
ru: Резервные плагины проверки

source: Fallback plugins and order. Note, if a fallback plugin is not setup for an account it will not be active in the TFA form.
ru: Резервные плагины и их порядок. Обратите внимание, что если резервный плагин не настроен для учетной записи, он не будет активен в форме TFA.

source: Order
ru: Порядок

source: Login plugins
ru: Плагины входа

source: Plugins that can allow a user to skip the TFA process. If any plugin returns true the user will not be required to follow TFA. <strong>Use with caution.</strong>
ru: Плагины, которые могут позволить пользователю пропустить процесс TFA. Если какой-либо плагин возвращает true, пользователю не потребуется проходить TFA. <strong> Следует использовать с осторожностью.</strong>

source: Save configuration
ru: Сохранить конфигурацию

source: Configuration saved
ru: Конфигурация сохранена

source: Can't access your account?
ru: Не удается получить доступ к своей учетной записи?

source: You have just used your one-time login link. It is no longer necessary to use this link to log in. Please change your password.
ru: Вы только что использовали вашу ссылку одноразового входа. Она больше недействительна. Пожалуйста, введите ваш новый пароль.

source: You have reached the threshold for incorrect code entry attempts. Please try again in !time minutes.
ru: Вы достигли порога неправильных попыток ввода кода. Повторите попытку через !time минут.

source: You have reached the threshold for TFA attempts. Please try again in !time minutes.
ru: Вы достигли порога для попыток TFA. Повторите попытку через !time минут.

source: User %name used one-time login link
ru: Пользователь %name использовал одноразовую ссылку для входа в систему

source: Administer TFA
ru: Администрирование TFA

source: Configure two-factor authentication settings.
ru: Настройка параметров двухфакторной аутентификации.

source: For up-to-date help see the <a href="!url">TFA module documentation</a> on drupal.org.
ru: Для получения последней справки см. <a href="!url">Документацию модуля TFA</a> на drupal.org.

source: Two-factor Authentication for Drupal
ru: Двухфакторная аутентификация для Drupal

source: TFA is a base module for providing two-factor authentication for your Drupal site. As such it provides a framework for specific TFA plugins that act during user authentication to confirm a "second factor" for the user.
ru: TFA является базовым модулем для обеспечения двухфакторной аутентификации для вашего сайта Drupal. Таким образом, он обеспечивает структуру для конкретных плагинов TFA, которые действуют во время аутентификации пользователя, чтобы подтвердить «второй фактор» для пользователя.

source: Session closed for %name.
ru: Для %name сессия закрыта.

source: Session opened for %name.
ru: Сессия для %name открыта.

source: Two-Factor Authentication
ru: Двухфакторная аутентификация

source: Two-factor Authentication
ru: Двухфакторная аутентификация

source: TFA process and plugin settings
ru: Настройка TFA и плагинов

source: The TFA module requires the PHP Mcrypt extension be installed on the web server.
ru: Модуль TFA требует, чтобы расширение PHP Mcrypt было установлено на веб-сервере.

source: Two-factor authentication
ru: Двухфакторная аутентификация

source: Two-factor Authentication (TFA)
ru: Двухфакторная аутентификация (TFA)

source: Pluggable provider of second factor authentication for Drupal
ru: Подключаемый провайдер аутентификации второго фактора для Drupal
